test/site/content-org/all-posts.org
#+hugo_base_dir: ../

#+seq_todo: TODO DRAFT DONE
#+seq_todo: TEST__TODO | TEST__DONE

#+property: header-args :eval never-export

#+startup: indent

#+macro: doc [[https://ox-hugo.scripter.co/doc/$1][$2]]
#+macro: oxhugoissue =ox-hugo= Issue #[[https://github.com/kaushalmodi/ox-hugo/issues/$1][$1]]
#+macro: hugoissue =hugo= Issue #[[https://github.com/gohugoio/hugo/issues/$1][$1]]
#+macro: hugopr =hugo= PR #[[https://github.com/gohugoio/hugo/pull/$1][$1]]
#+macro: bfissue /Blackfriday/ Issue #[[https://github.com/russross/blackfriday/issues/$1][$1]]
#+macro: commit commit [[https://github.com/kaushalmodi/ox-hugo/commit/$1][$1]]

# https://scripter.co/latex-in-html/
#+macro: latex @@html:<span class="latex">L<sup>a</sup>T<sub>e</sub>X</span>@@
#+macro: youtube @@html:<div class="org-youtube"><iframe src="https://www.youtube-nocookie.com/embed/$1" allowfullscreen title="YouTube Video"></iframe></div>@@

#+bibliography: cite/bib/orgcite.bib

#+author:

** Links outside the same post
:PROPERTIES:
:EXPORT_FILE_NAME: links-outside-the-same-post
:END:
{{{oxhugoissue(30)}}}
*** External links with search options                       :external_links:
Links between documents can contain some search options. Only links
to a heading with a *:CUSTOM_ID* property will be resolved to the
appropriate location in the linked file. Links to headings and
links to targets will be resolved to the containing file.

- [[file:link-destination.org::#external-target][Link to CUSTOM_ID]]
- [[file:link-destination.org::*external-target][Link to a heading]]
- [[file:link-destination.org::external-target][Link to a target]]
*** Internal links                                           :internal_links:
Internal links point to targets in the current subtree that will be
exported to the same Hugo post as the link source. To handle links to
an *:ID* property, the =org-id= feature must first be loaded, either
through =org-customize= or by adding =(require 'org-id)= in your Emacs
init file.

- [[#internal-target][Link to CUSTOM_ID within the same post]]
- [[id:8e65ff86-3f9a-48ef-9b43-751a2e8a9372][Link to ID within the same post]]
- [[*Internal target][Link to heading within the same post]]
- [[internal-target][Link to target within the same post]]
*** Cross-post links                                        :crosspost_links:
Cross-post links are internal links pointing to targets in a different
subtree that will be exported to another Hugo post than the link
source in subtree-based exports. The Hugo's ~ref~ and ~relref~
shortcodes only supports anchors to headings, so links to a heading,
a *:CUSTOM_ID* property, or an *:ID* property will be resolved to the
appropriate location in the linked file, but links to targets will be
resolved to the containing post.
**** Links without descriptions
- Link to CUSTOM_ID outside the same post: [[#external-target]]
- Link to ID outside the same post: [[id:de0df718-f9b4-4449-bb0a-eb4402fa5fcb]]
- Link to target outside the same post: [[*External target]]
- Another link to target outside the same post: [[* External target with *bold* and /italic/]]
- Link to subtree by CUSTOM_ID: [[#link-destination]]
- Link to subtree by ID: [[id:1e5e0bcd-caea-40ad-a75b-e488634c2678]]
- Link to subtree by heading: [[*Link destination]]
**** Links with descriptions
- [[#external-target][Link to CUSTOM_ID outside the same post]]
- [[id:de0df718-f9b4-4449-bb0a-eb4402fa5fcb][Link to ID outside the same post]]
- [[*External target][Link to target outside the same post]]
- [[* External target with *bold* and /italic/][Another link to target outside the same post]]
- [[#link-destination][Link to subtree by CUSTOM_ID]]
- [[id:1e5e0bcd-caea-40ad-a75b-e488634c2678][Link to subtree by ID]]
- [[*Link destination][Link to subtree by heading]]
*** Internal target
:PROPERTIES:
:CUSTOM_ID: internal-target
:ID:       8e65ff86-3f9a-48ef-9b43-751a2e8a9372
:END:
<<internal-target>>
*** Link destination
:PROPERTIES:
:CUSTOM_ID: link-destination
:EXPORT_FILE_NAME: link-destination
:ID:       1e5e0bcd-caea-40ad-a75b-e488634c2678
:END:
**** External target
:PROPERTIES:
:CUSTOM_ID: external-target
:ID:       de0df718-f9b4-4449-bb0a-eb4402fa5fcb
:END:
<<external-target>>
**** External target with *bold* and /italic/
